<a href="https://colab.research.google.com/github/sbj6364/python-study/blob/main/pandas-basic/15_concat2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 15번 : concat(2)

데이터에서 주어진 형태가 같은 2개의 DataFrame 을 이용해서,

Output처럼 양옆으로 합쳐진 DataFrame을 생성하는 코드를 작성해보세요.



#### data
~~~
	A	B	C
0	1	3	5
1	2	4	6
~~~
~~~
	A	B	C
0	-1	-3	-5
1	-2	-4	-6
~~~

In [4]:
import pandas as pd
import numpy as np

ar1 = [[1,3,5],[2,4,6]]
ar2 = [[-1,-3,-5],[-2,-4,-6]]
df1 = pd.DataFrame(ar1, columns=['A','B','C'])
df2 = pd.DataFrame(ar2, columns=['A','B','C'])

pd.concat([df1, df2], axis=1, ignore_index=True)

   0  1  2  3  4  5
0  1  3  5 -1 -3 -5
1  2  4  6 -2 -4 -6